In [265]:
#District Summary

# Create a high level snapshot (in table form) of the district's key metrics, including:

# Total Schools
# Total Students
# Total Budget
# Average Math Score
# Average Reading Score
# % Passing Math (The percentage of students that passed math.)
# % Passing Reading (The percentage of students that passed reading.)
# % Overall Passing (The percentage of students that passed math and reading.).

In [266]:
import pandas as pd
import numpy as np

In [267]:
#reading school csv to dataframe
schools_path = r"/Users/rosaicelaroman/Desktop/Data_BootCamp/LearnPython/pandas-challenge/PyCitySchools/Resources/schools_complete.csv"
schools_df = pd.read_csv(schools_path)
schools_df.head(3)

   School ID           school_name      type  size   budget
0          0     Huang High School  District  2917  1910635
1          1  Figueroa High School  District  2949  1884411
2          2   Shelton High School   Charter  1761  1056600

In [268]:
#reading students csv to dataframe
schools_path = r"/Users/rosaicelaroman/Desktop/Data_BootCamp/LearnPython/pandas-challenge/PyCitySchools/Resources/students_complete.csv"
students_df = pd.read_csv(schools_path)
students_df.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60

In [269]:
#district summary
#--------------------------------
#dataframe info
schools_df.info()
schools_df.columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   School ID    15 non-null     int64
 1   school_name  15 non-null     object
 2   type         15 non-null     object
 3   size         15 non-null     int64
 4   budget       15 non-null     int64
dtypes: int64(3), object(2)
memory usage: 728.0+ bytes

Index(['School ID', 'school_name', 'type', 'size', 'budget'], dtype='object')

In [270]:
#total schools
total_schools = schools_df["school_name"].count()
total_schools

15

In [271]:
#total students
total_students = schools_df["size"].sum()
total_students = "{:,}".format(total_students)
total_students

'39,170'

In [272]:
#total budget
total_budget = schools_df["budget"].sum()
total_budget = "${:,}".format(total_budget)
total_budget

'$24,649,428'

In [273]:
#calculate average math score
students_df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score'],
      dtype='object')

In [274]:
avg_math = round(students_df['math_score'].mean(),2)
avg_math

78.99

In [275]:
#calculate average reading score
avg_reading = round(students_df['reading_score'].mean(),2)
avg_reading

81.88

In [276]:
#* Calculate the percentage of students with a passing math score (70 or greater)
bins = [0, 69,100]
group_names = ['not passing','passing']
copy_students_df = students_df.copy()
copy_students_df['math_score']=pd.cut(copy_students_df['math_score'], bins, labels = group_names)
copy_students_df['reading_score']=pd.cut(copy_students_df['reading_score'], bins, labels = group_names)
copy_students_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,not passing,passing
1,1,Victor Smith,M,12th,Huang High School,passing,not passing
2,2,Kevin Rodriguez,M,12th,Huang High School,passing,not passing
3,3,Dr. Richard Scott,M,12th,Huang High School,not passing,not passing
4,4,Bonnie Ray,F,9th,Huang High School,passing,passing
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,passing,passing
39166,39166,Dawn Bell,F,10th,Thomas High School,passing,passing
39167,39167,Rebecca Tanner,F,9th,Thomas High School,passing,passing
39168,39168,Desiree Kidd,F,10th,Thomas High School,passing,passing
39169,39169,Carolyn Jackson,F,11th,Thomas High School,passing,passing

In [277]:
conditions = [(copy_students_df['reading_score'] == 'passing') & (copy_students_df['math_score'] == 'passing'), (copy_students_df['math_score'] != 'passing')]
choices = ['passing', 'not passing']
copy_students_df['overall_passing'] = np.select(conditions, choices, default = 'not passing')
copy_students_df.head(20)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,overall_passing
0,0,Paul Bradley,M,9th,Huang High School,not passing,passing,not passing
1,1,Victor Smith,M,12th,Huang High School,passing,not passing,not passing
2,2,Kevin Rodriguez,M,12th,Huang High School,passing,not passing,not passing
3,3,Dr. Richard Scott,M,12th,Huang High School,not passing,not passing,not passing
4,4,Bonnie Ray,F,9th,Huang High School,passing,passing,passing
5,5,Bryan Miranda,M,9th,Huang High School,passing,passing,passing
6,6,Sheena Carter,F,11th,Huang High School,passing,passing,passing
7,7,Nicole Baker,F,12th,Huang High School,passing,not passing,not passing
8,8,Michael Roth,M,10th,Huang High School,passing,passing,passing
9,9,Matthew Greene,M,10th,Huang High School,passing,passing,passing
10,10,Andrew Alexander,M,10th,Huang High School,passing,passing,passing
11,11,Daniel Cooper,M,10th,Huang High School,passing,passing,passing
12,12,Brittney Walker,F,9th,Huang High School,not passing,passing,not passing
13,13,William Long,M,9th,Huang High School,passing,passing,passing
14,14,Tammy Hebert,F,10th,Huang High School,passing,not passing,not passing
15,15,Dr. Jordan Carson,M,11th,Huang High School,passing,passing,passing
16,16,Donald Zamora,M,9th,Huang High School,passing,not passing,not passing
17,17,Kimberly Santiago,F,9th,Huang High School,passing,passing,passing
18,18,Kevin Stevens,M,9th,Huang High School,not passing,not passing,not passing
19,19,Brandi Lyons,F,9th,Huang High School,passing,passing,passing

In [278]:
# Calculate the percentage of students with a passing reading score (70 or greater)
math_passing = copy_students_df['math_score'].value_counts()

In [279]:
reading_passing = copy_students_df['reading_score'].value_counts()

In [280]:
overall_passing = copy_students_df['overall_passing'].value_counts()

In [281]:
summary_df_1 = pd.DataFrame(math_passing)
summary_df_1.index.name = "Student Status"
summary_df_1

                math_score
Student Status
passing              29370
not passing           9800

In [282]:
summary_df_2 = pd.DataFrame(reading_passing)
summary_df_2.index.name = "Student Status"
summary_df_2

                reading_score
Student Status
passing                 33610
not passing              5560

In [283]:
summary_df_3 = pd.DataFrame(overall_passing)
summary_df_3.index.name = "Student Status"
summary_df_3

                overall_passing
Student Status
passing                   25528
not passing               13642

In [284]:
perc_math = round(copy_students_df['math_score'].value_counts(normalize=True)*100,2)

In [285]:
summary_df_4 = pd.DataFrame(perc_math)
summary_df_4.index.name = "Student Status"
summary_df_4 = summary_df_4.rename(columns={"math_score": "% Math"})
summary_df_4

                % Math
Student Status
passing          74.98
not passing      25.02

In [286]:
perc_reading = round(copy_students_df['reading_score'].value_counts(normalize=True)*100,2)

In [287]:
summary_df_5 = pd.DataFrame(perc_reading)
summary_df_5.index.name = "Student Status"
summary_df_5 = summary_df_5.rename(columns={"reading_score": "% Reading"})
summary_df_5

                % Reading
Student Status
passing             85.81
not passing         14.19

In [288]:
overall_passing_perc= perc_reading = round(copy_students_df['overall_passing'].value_counts(normalize=True)*100,2)

In [289]:
summary_df_6 = pd.DataFrame(overall_passing_perc)
summary_df_6.index.name = "Student Status"
summary_df_6 = summary_df_6.rename(columns={"overall_passing": "% Overall Passing"})
summary_df_6

                % Overall Passing
Student Status
passing                     65.17
not passing                 34.83

In [290]:
combined_df = summary_df_1.join(summary_df_2, how='outer')
combined_df = combined_df.join(summary_df_3, how='outer')
combined_df = combined_df.join(summary_df_4, how='outer')
combined_df = combined_df.join(summary_df_5, how='outer')
combined_df = combined_df.join(summary_df_6, how='outer')
combined_df

,math_score,reading_score,overall_passing,% Math,% Reading,% Overall Passing
Student Status,,,,,,
passing,29370,33610,25528,74.98,85.81,65.17
not passing,9800,5560,13642,25.02,14.19,34.83

In [291]:
combined_df = combined_df.rename(columns={"math_score": "Math Score", "reading_score": "Reading Score", "overall_passing": "Overall Passing"})
combined_df

,Math Score,Reading Score,Overall Passing,% Math,% Reading,% Overall Passing
Student Status,,,,,,
passing,29370,33610,25528,74.98,85.81,65.17
not passing,9800,5560,13642,25.02,14.19,34.83

In [292]:
data = {'Total Schools': [total_schools], 'Total Students': [total_students], 'Total Budget': [total_budget], 'Average Math Score': [avg_math], 'Average Reading Score': [avg_reading], '% Passing Math': [combined_df.iloc[0,3]], '% Passing Reading':[combined_df.iloc[0,4]], "% Overall Passing": [combined_df.iloc[0,5]]}
district_df = pd.DataFrame.from_dict(data)
district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428",78.99,81.88,74.98,85.81,65.17

In [293]:
#  School Summary
 
# Create an overview table that summarizes key metrics about each school, including:
# School Name
# School Type
# Total Students
# Total School Budget
# Per Student Budget
# Average Math Score
# Average Reading Score
# % Passing Math
# % Passing Reading
# % Overall Passing (The percentage of students that passed math and reading.)
# Create a dataframe to hold the above results

In [294]:
#schools_df
school_student_df = round(students_df.groupby(['school_name'])['reading_score', 'math_score'].mean(),2)

school_student_df

                       reading_score  math_score
school_name
Bailey High School             81.03       77.05
Cabrera High School            83.98       83.06
Figueroa High School           81.16       76.71
Ford High School               80.75       77.10
Griffin High School            83.82       83.35
Hernandez High School          80.93       77.29
Holden High School             83.81       83.80
Huang High School              81.18       76.63
Johnson High School            80.97       77.07
Pena High School               84.04       83.84
Rodriguez High School          80.74       76.84
Shelton High School            83.73       83.36
Thomas High School             83.85       83.42
Wilson High School             83.99       83.27
Wright High School             83.96       83.68

In [295]:
copy_schools_df = schools_df.copy()
copy_schools_df.columns

Index(['School ID', 'school_name', 'type', 'size', 'budget'], dtype='object')

In [296]:
combined_district_df = pd.merge(copy_schools_df,school_student_df,how='outer',on='school_name')
combined_district_df

,School ID,school_name,type,size,budget,reading_score,math_score
0,0,Huang High School,District,2917,1910635,81.18,76.63
1,1,Figueroa High School,District,2949,1884411,81.16,76.71
2,2,Shelton High School,Charter,1761,1056600,83.73,83.36
3,3,Hernandez High School,District,4635,3022020,80.93,77.29
4,4,Griffin High School,Charter,1468,917500,83.82,83.35
5,5,Wilson High School,Charter,2283,1319574,83.99,83.27
6,6,Cabrera High School,Charter,1858,1081356,83.98,83.06
7,7,Bailey High School,District,4976,3124928,81.03,77.05
8,8,Holden High School,Charter,427,248087,83.81,83.80
9,9,Pena High School,Charter,962,585858,84.04,83.84
10,10,Wright High School,Charter,1800,1049400,83.96,83.68
11,11,Rodriguez High School,District,3999,2547363,80.74,76.84
12,12,Johnson High School,District,4761,3094650,80.97,77.07
13,13,Ford High School,District,2739,1763916,80.75,77.10
14,14,Thomas High School,Charter,1635,1043130,83.85,83.42

In [297]:
combined_district_df = combined_district_df.drop('School ID', axis=1)
combined_district_df = combined_district_df.set_index(['school_name'])
combined_district_df = combined_district_df.sort_index(ascending=True)
combined_district_df

                           type  size   budget  reading_score  math_score
school_name
Bailey High School     District  4976  3124928          81.03       77.05
Cabrera High School     Charter  1858  1081356          83.98       83.06
Figueroa High School   District  2949  1884411          81.16       76.71
Ford High School       District  2739  1763916          80.75       77.10
Griffin High School     Charter  1468   917500          83.82       83.35
Hernandez High School  District  4635  3022020          80.93       77.29
Holden High School      Charter   427   248087          83.81       83.80
Huang High School      District  2917  1910635          81.18       76.63
Johnson High School    District  4761  3094650          80.97       77.07
Pena High School        Charter   962   585858          84.04       83.84
Rodriguez High School  District  3999  2547363          80.74       76.84
Shelton High School     Charter  1761  1056600          83.73       83.36
Thomas High School      Charter  1635  1043130          83.85       83.42
Wilson High School      Charter  2283  1319574          83.99       83.27
Wright High School      Charter  1800  1049400          83.96       83.68

In [298]:
combined_district_df = combined_district_df.rename(columns={"type": "School Type", "size": "Total Students", "budget": "Total School Budget","math_score": "Average Math Score","reading_score": "Average Reading Score"})
combined_district_df.index.names = [""]
# combined_district_df = combined_district_df.astype({'Total School Budget': 'int32'}).dtypes#"${:,}".format(combined_district_df['Total School Budget'])
combined_district_df

,School Type,Total Students,Total School Budget,Average Reading Score,Average Math Score
,,,,,
Bailey High School,District,4976,3124928,81.03,77.05
Cabrera High School,Charter,1858,1081356,83.98,83.06
Figueroa High School,District,2949,1884411,81.16,76.71
Ford High School,District,2739,1763916,80.75,77.10
Griffin High School,Charter,1468,917500,83.82,83.35
Hernandez High School,District,4635,3022020,80.93,77.29
Holden High School,Charter,427,248087,83.81,83.80
Huang High School,District,2917,1910635,81.18,76.63
Johnson High School,District,4761,3094650,80.97,77.07
Pena High School,Charter,962,585858,84.04,83.84
Rodriguez High School,District,3999,2547363,80.74,76.84
Shelton High School,Charter,1761,1056600,83.73,83.36
Thomas High School,Charter,1635,1043130,83.85,83.42
Wilson High School,Charter,2283,1319574,83.99,83.27
Wright High School,Charter,1800,1049400,83.96,83.68

In [299]:
combined_district_df['Per Student Budget'] = combined_district_df['Total School Budget']/combined_district_df['Total Students']
combined_district_df

,School Type,Total Students,Total School Budget,Average Reading Score,Average Math Score,Per Student Budget
,,,,,,
Bailey High School,District,4976,3124928,81.03,77.05,628.0
Cabrera High School,Charter,1858,1081356,83.98,83.06,582.0
Figueroa High School,District,2949,1884411,81.16,76.71,639.0
Ford High School,District,2739,1763916,80.75,77.10,644.0
Griffin High School,Charter,1468,917500,83.82,83.35,625.0
Hernandez High School,District,4635,3022020,80.93,77.29,652.0
Holden High School,Charter,427,248087,83.81,83.80,581.0
Huang High School,District,2917,1910635,81.18,76.63,655.0
Johnson High School,District,4761,3094650,80.97,77.07,650.0
Pena High School,Charter,962,585858,84.04,83.84,609.0
Rodriguez High School,District,3999,2547363,80.74,76.84,637.0
Shelton High School,Charter,1761,1056600,83.73,83.36,600.0
Thomas High School,Charter,1635,1043130,83.85,83.42,638.0
Wilson High School,Charter,2283,1319574,83.99,83.27,578.0
Wright High School,Charter,1800,1049400,83.96,83.68,583.0

In [312]:
grouped_school_scores = copy_students_df.groupby(["math_score", 'school_name']).agg({"Student ID": 'count'})
grouped_school_scores

                                   Student ID
math_score  school_name
not passing Bailey High School           1658
            Cabrera High School           109
            Figueroa High School         1003
            Ford High School              868
            Griffin High School            97
            Hernandez High School        1541
            Holden High School             32
            Huang High School            1001
            Johnson High School          1616
            Pena High School               52
            Rodriguez High School        1345
            Shelton High School           108
            Thomas High School            110
            Wilson High School            140
            Wright High School            120
passing     Bailey High School           3318
            Cabrera High School          1749
            Figueroa High School         1946
            Ford High School             1871
            Griffin High School          1371
            Hernandez High School        3094
            Holden High School            395
            Huang High School            1916
            Johnson High School          3145
            Pena High School              910
            Rodriguez High School        2654
            Shelton High School          1653
            Thomas High School           1525
            Wilson High School           2143
            Wright High School           1680